Autodesk.Revit.DB.Structure.RebarSplicePosition
Describes the position of the splice.
Remarks:
This class describes the position of the splice face with respect to each bar end involved in splice.
Middle describes the behavior when both bar ends extends with half of the lap length and the splice plane sits between them.
End1 and End2 describes the behavior when one of the bar ends is on the splice plane and the other bar end extends with the lap length.
End1 means that the lap is computed towards the start of the splice chain, while End2 means that the lap is computed towards the end of the splice chain.
A splice chain represents an array of spliced rebars ordered by constraints (second is constrained to first, third to second and so on).
Since:
2025
Since:
2025

Autodesk.Revit.DB.Structure.RebarSplicePosition.End2
Lap is towards the end of the splice chain.

Autodesk.Revit.DB.Structure.RebarSplicePosition.Middle
Lap goes into both directions.

Autodesk.Revit.DB.Structure.RebarSplicePosition.End1
Lap is towards the start of the splice chain.